app/controllers/posts_controller.rb

	def update
	  @dick = Post.find(params[:id])
	  @dick.update(params.require(:post).permit(:title, :description))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Cool"], ["description", "Update"], ["updated_at", "2020-08-08 19:07:47.177122"], ["id", 1]]

	def edit
	  @dick = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]